; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p0-3 - location
	p1-5 - location
	p1-8 - location
	p2-0 - location
	p2-4 - location
	p3-2 - location
	p3-7 - location
	p4-0 - location
	p4-6 - location
	p4-8 - location
	p5-2 - location
	p5-6 - location
	p7-9 - location
	p8-2 - location
	p9-0 - location
	p9-1 - location
	p9-2 - location
	p9-3 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s0)
	(at driver3 s2)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at package1 s4)
	(at package2 s4)
	(at package3 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 93)
	(= (time-to-walk p0-1 s0) 93)
	(= (time-to-walk s1 p0-1) 99)
	(= (time-to-walk p0-1 s1) 99)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 6)
	(= (time-to-walk p0-3 s0) 6)
	(= (time-to-walk s3 p0-3) 8)
	(= (time-to-walk p0-3 s3) 8)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 28)
	(= (time-to-walk p1-5 s1) 28)
	(= (time-to-walk s5 p1-5) 80)
	(= (time-to-walk p1-5 s5) 80)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 10)
	(= (time-to-walk p1-8 s1) 10)
	(= (time-to-walk s8 p1-8) 6)
	(= (time-to-walk p1-8 s8) 6)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 3)
	(= (time-to-walk p2-0 s2) 3)
	(= (time-to-walk s0 p2-0) 55)
	(= (time-to-walk p2-0 s0) 55)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 86)
	(= (time-to-walk p2-4 s2) 86)
	(= (time-to-walk s4 p2-4) 37)
	(= (time-to-walk p2-4 s4) 37)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 76)
	(= (time-to-walk p3-2 s3) 76)
	(= (time-to-walk s2 p3-2) 98)
	(= (time-to-walk p3-2 s2) 98)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 51)
	(= (time-to-walk p3-7 s3) 51)
	(= (time-to-walk s7 p3-7) 88)
	(= (time-to-walk p3-7 s7) 88)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 19)
	(= (time-to-walk p4-0 s4) 19)
	(= (time-to-walk s0 p4-0) 25)
	(= (time-to-walk p4-0 s0) 25)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 23)
	(= (time-to-walk p4-6 s4) 23)
	(= (time-to-walk s6 p4-6) 20)
	(= (time-to-walk p4-6 s6) 20)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 70)
	(= (time-to-walk p4-8 s4) 70)
	(= (time-to-walk s8 p4-8) 72)
	(= (time-to-walk p4-8 s8) 72)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 62)
	(= (time-to-walk p5-2 s5) 62)
	(= (time-to-walk s2 p5-2) 13)
	(= (time-to-walk p5-2 s2) 13)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 77)
	(= (time-to-walk p5-6 s5) 77)
	(= (time-to-walk s6 p5-6) 11)
	(= (time-to-walk p5-6 s6) 11)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(= (time-to-walk s7 p7-9) 27)
	(= (time-to-walk p7-9 s7) 27)
	(= (time-to-walk s9 p7-9) 84)
	(= (time-to-walk p7-9 s9) 84)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 78)
	(= (time-to-walk p8-2 s8) 78)
	(= (time-to-walk s2 p8-2) 21)
	(= (time-to-walk p8-2 s2) 21)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(= (time-to-walk s9 p9-0) 62)
	(= (time-to-walk p9-0 s9) 62)
	(= (time-to-walk s0 p9-0) 70)
	(= (time-to-walk p9-0 s0) 70)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(= (time-to-walk s9 p9-1) 20)
	(= (time-to-walk p9-1 s9) 20)
	(= (time-to-walk s1 p9-1) 68)
	(= (time-to-walk p9-1 s1) 68)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(= (time-to-walk s9 p9-2) 78)
	(= (time-to-walk p9-2 s9) 78)
	(= (time-to-walk s2 p9-2) 47)
	(= (time-to-walk p9-2 s2) 47)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 47)
	(= (time-to-walk p9-3 s9) 47)
	(= (time-to-walk s3 p9-3) 87)
	(= (time-to-walk p9-3 s3) 87)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 53)
	(= (time-to-drive s4 s0) 53)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 49)
	(= (time-to-drive s5 s0) 49)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 42)
	(= (time-to-drive s9 s0) 42)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 38)
	(= (time-to-drive s0 s1) 38)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 86)
	(= (time-to-drive s4 s1) 86)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 17)
	(= (time-to-drive s5 s1) 17)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 36)
	(= (time-to-drive s6 s1) 36)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 37)
	(= (time-to-drive s7 s1) 37)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 5)
	(= (time-to-drive s8 s1) 5)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 54)
	(= (time-to-drive s3 s2) 54)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 62)
	(= (time-to-drive s5 s2) 62)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 28)
	(= (time-to-drive s4 s3) 28)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 73)
	(= (time-to-drive s7 s3) 73)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 31)
	(= (time-to-drive s9 s3) 31)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 99)
	(= (time-to-drive s8 s5) 99)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 35)
	(= (time-to-drive s0 s6) 35)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 43)
	(= (time-to-drive s2 s6) 43)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 75)
	(= (time-to-drive s7 s6) 75)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 45)
	(= (time-to-drive s0 s7) 45)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 70)
	(= (time-to-drive s4 s7) 70)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 58)
	(= (time-to-drive s5 s7) 58)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 22)
	(= (time-to-drive s4 s8) 22)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 91)
	(= (time-to-drive s7 s8) 91)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 20)
	(= (time-to-drive s2 s9) 20)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 92)
	(= (time-to-drive s4 s9) 92)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 10)
	(= (time-to-drive s5 s9) 10)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 87)
	(= (time-to-drive s8 s9) 87)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at truck1 s2)
	(at truck4 s7)
	(at truck5 s4)
	(at package1 s4)
	(at package2 s1)
	(at package3 s9)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 1 of 6
2. (board-truck driver2 truck5 s0)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 1 of 6
3. (drive-truck truck4 s2 s5 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   changed: (driven) from 0 to 62
   goals met: 1 of 6
4. (drive-truck truck4 s5 s7 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   changed: (driven) from 62 to 120
   goals met: 2 of 6
5. (disembark-truck driver3 truck4 s7)
   deleted: (driving driver3 truck4)
   added: (at driver3 s7) (empty truck4)
   goals met: 2 of 6
6. (board-truck driver3 truck1 s7)
   deleted: (at driver3 s7) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 6
7. (drive-truck truck1 s7 s6 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   changed: (driven) from 120 to 195
   goals met: 2 of 6
8. (drive-truck truck1 s6 s2 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 195 to 238
   goals met: 3 of 6
9. (drive-truck truck5 s0 s4 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (driven) from 238 to 291
   goals met: 4 of 6
10. (load-truck package2 truck5 s4)
   deleted: (at package2 s4)
   added: (in package2 truck5)
   goals met: 4 of 6
11. (drive-truck truck5 s4 s1 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (driven) from 291 to 377
   goals met: 3 of 6
12. (unload-truck package2 truck5 s1)
   deleted: (in package2 truck5)
   added: (at package2 s1)
   goals met: 4 of 6
13. (drive-truck truck5 s1 s4 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   changed: (driven) from 377 to 463
   goals met: 5 of 6
14. (drive-truck truck1 s2 s6 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 463 to 506
   goals met: 4 of 6
15. (load-truck package3 truck1 s6)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   goals met: 4 of 6
16. (drive-truck truck1 s6 s2 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 506 to 549
   goals met: 5 of 6
17. (drive-truck truck1 s2 s9 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   changed: (driven) from 549 to 569
   goals met: 4 of 6
18. (unload-truck package3 truck1 s9)
   deleted: (in package3 truck1)
   added: (at package3 s9)
   goals met: 5 of 6
19. (drive-truck truck1 s9 s2 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s2)
   changed: (driven) from 569 to 589
   goals met: 6 of 6
